Revit 2027 API
ConnectorJointType Enumeration
 Connector joint type enum
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConnectorJointType
Public Enumeration ConnectorJointType
public enum class ConnectorJointType
type ConnectorJointType
Members
Member name | Value | Description
Flanged | 1 |  Flanged connector joint type
Glued | 5 |  Glued connector joint type
Grooved | 4 |  Grooved connector joint type
Soldered | 6 |  Soldered connector joint type
Threaded | 3 |  Threaded connector joint type
Undefined | 0 |  Undefined connector joint type
Welded | 2 |  Welded connector joint type
See Also
Reference
Autodesk.Revit.DB Namespace